Ran Plan for 2 projects:

1. dir: `devops-dev/global/eu-central-1/common/vpc/dev3` workspace: `devops-dev_global_eu-central-1_common_vpc_dev3`
1. dir: `devops-dev/t1/eu-central-1/skeleton/ecs_clusters/mycluster5` workspace: `devops-dev_t1_eu-central-1_skeleton_ecs_clusters_mycluster5`
---

### 1. dir: `devops-dev/global/eu-central-1/common/vpc/dev3` workspace: `devops-dev_global_eu-central-1_common_vpc_dev3`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' 'terragrunt plan -input=false $(printf '%s' $COMMENT_ARGS | sed 's/,/ /g' | tr -d '\\') -no-color -out $PLANFILE' in '/root/.atlantis/repos/cryptocat-org/devops-digger/12/devops-dev_global_eu-central-1_common_vpc_dev3/devops-dev/global/eu-central-1/common/vpc/dev3': exit status 1: running "terragrunt plan -input=false $(printf '%s' $COMMENT_ARGS | sed 's/,/ /g' | tr -d '\\\\') -no-color -out $PLANFILE" in "/root/.atlantis/repos/cryptocat-org/devops-digger/12/devops-dev_global_eu-central-1_common_vpc_dev3/devops-dev/global/eu-central-1/common/vpc/dev3": 
09:23:17.214 WARN   The `TERRAGRUNT_TFPATH` environment variable is deprecated and will be removed in a future version of Terragrunt. Use `TG_TF_PATH=terraform1.10.5` instead.
09:23:19.215 INFO   Downloading Terraform configurations from git::ssh://git@github.com/cryptocat-org/modules.git/?ref=modules/aws/vpc/generic/v1.0.0 into ./.terragrunt-cache/cFp7YMpMYVHFMOVL5bfC-OXx6Qc/miQS14gcWYEp0r0pN3_910gVfps
09:23:21.423 INFO   terraform1.10.5: Initializing the backend...
09:23:21.711 INFO   terraform1.10.5: Successfully configured the backend "s3"! Terraform will automatically
09:23:21.712 INFO   terraform1.10.5: use this backend unless the backend configuration changes.
09:23:21.907 INFO   terraform1.10.5: Initializing modules...
09:23:21.908 INFO   terraform1.10.5: Downloading git::ssh://git@github.com/cryptocat-org/modules.git?ref=modules/global/label/v1.0.0 for label...
09:23:22.828 INFO   terraform1.10.5: - label in .terraform/modules/label
09:23:22.828 INFO   terraform1.10.5: Downloading git::ssh://git@github.com/cryptocat-org/modules.git?ref=modules/global/label/v1.0.0 for this...
09:23:22.910 INFO   terraform1.10.5: - this in .terraform/modules/this
09:23:22.927 INFO   terraform1.10.5: Downloading registry.terraform.io/terraform-aws-modules/vpc/aws 5.19.0 for vpc...
09:23:26.516 INFO   terraform1.10.5: - vpc in .terraform/modules/vpc
09:23:26.607 INFO   terraform1.10.5: Initializing provider plugins...
09:23:26.607 INFO   terraform1.10.5: - Finding hashicorp/aws versions matching ">= 5.79.0"...
09:23:26.822 INFO   terraform1.10.5: - Installing hashicorp/aws v5.95.0...
09:24:38.129 INFO   terraform1.10.5: - Installed hashicorp/aws v5.95.0 (signed by HashiCorp)
09:24:38.134 INFO   terraform1.10.5: Terraform has created a lock file .terraform.lock.hcl to record the provider
09:24:38.134 INFO   terraform1.10.5: selections it made above. Include this file in your version control repository
09:24:38.134 INFO   terraform1.10.5: so that Terraform can guarantee to make the same selections by default when
09:24:38.134 INFO   terraform1.10.5: you run "terraform init" in the future.
09:24:38.206 INFO   terraform1.10.5: Terraform has been successfully initialized!
09:25:07.522 STDERR terraform1.10.5: Error: Error acquiring the state lock
09:25:07.522 STDERR terraform1.10.5: Error message: operation error DynamoDB: PutItem, https response error
09:25:07.522 STDERR terraform1.10.5: StatusCode: 400, RequestID:
09:25:07.523 STDERR terraform1.10.5: IRPNO90VQPPC42NID3L5PEC3JBVV4KQNSO5AEMVJF66Q9ASUAAJG,
09:25:07.523 STDERR terraform1.10.5: ConditionalCheckFailedException: The conditional request failed
09:25:07.523 STDERR terraform1.10.5: Lock Info:
09:25:07.523 STDERR terraform1.10.5:   ID:        3e337841-f222-162f-7277-f5f64bcbd7d6
09:25:07.523 STDERR terraform1.10.5:   Path:      yolo-terraform-devops-dev/devops-dev/global/eu-central-1/common/vpc/dev3/terraform.tfstate
09:25:07.523 STDERR terraform1.10.5:   Operation: OperationTypePlan
09:25:07.523 STDERR terraform1.10.5:   Who:       root@ip-10-10-0-89.eu-central-1.compute.internal
09:25:07.523 STDERR terraform1.10.5:   Version:   1.11.3
09:25:07.523 STDERR terraform1.10.5:   Created:   2025-04-22 08:35:34.860733716 +0000 UTC
09:25:07.523 STDERR terraform1.10.5:   Info:      
09:25:07.523 STDERR terraform1.10.5: Terraform acquires a state lock to protect the state from being written
09:25:07.523 STDERR terraform1.10.5: by multiple users at the same time. Please resolve the issue above and try
09:25:07.523 STDERR terraform1.10.5: again. For most commands, you can disable locking with the "-lock=false"
09:25:07.523 STDERR terraform1.10.5: flag, but this is not recommended.
09:25:07.612 ERROR  terraform invocation failed in ./.terragrunt-cache/cFp7YMpMYVHFMOVL5bfC-OXx6Qc/miQS14gcWYEp0r0pN3_910gVfps
09:25:07.619 ERROR  error occurred:

* Failed to execute "terraform1.10.5 plan -input=false -out ./devops-dev_global_eu-central-1_common_vpc_dev3.tfplan -no-color" in ./.terragrunt-cache/cFp7YMpMYVHFMOVL5bfC-OXx6Qc/miQS14gcWYEp0r0pN3_910gVfps
  
  Error: Error acquiring the state lock
  
  Error message: operation error DynamoDB: PutItem, https response error
  StatusCode: 400, RequestID:
  IRPNO90VQPPC42NID3L5PEC3JBVV4KQNSO5AEMVJF66Q9ASUAAJG,
  ConditionalCheckFailedException: The conditional request failed
  Lock Info:
    ID:        3e337841-f222-162f-7277-f5f64bcbd7d6
    Path:      yolo-terraform-devops-dev/devops-dev/global/eu-central-1/common/vpc/dev3/terraform.tfstate
    Operation: OperationTypePlan
    Who:       root@ip-10-10-0-89.eu-central-1.compute.internal
    Version:   1.11.3
    Created:   2025-04-22 08:35:34.860733716 +0000 UTC
    Info:      
  
  
  Terraform acquires a state lock to protect the state from being written
  by multiple users at the same time. Please resolve the issue above and try
  again. For most commands, you can disable locking with the "-lock=false"
  flag, but this is not recommended.
  
  exit status 1



```
</details>

---
### 2. dir: `devops-dev/t1/eu-central-1/skeleton/ecs_clusters/mycluster5` workspace: `devops-dev_t1_eu-central-1_skeleton_ecs_clusters_mycluster5`
<details><summary>Show Output</summary>

```diff
09:25:33.416 WARN   The `TERRAGRUNT_TFPATH` environment variable is deprecated and will be removed in a future version of Terragrunt. Use `TG_TF_PATH=terraform1.10.5` instead.
09:25:36.169 WARN   Config ../../../../../global/eu-central-1/common/vpc/dev3/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
09:25:36.216 WARN   Config ../../../../../global/eu-central-1/common/vpc/dev3/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
09:25:59.529 STDOUT terraform1.10.5: Terraform used the selected providers to generate the following execution
09:25:59.543 STDOUT terraform1.10.5: plan. Resource actions are indicated with the following symbols:
09:25:59.543 STDOUT terraform1.10.5:   + create
09:25:59.543 STDOUT terraform1.10.5: Terraform will perform the following actions:
09:25:59.543 STDOUT terraform1.10.5:   # module.autoscaling["on-demand"].aws_autoscaling_group.idc[0] will be created
09:25:59.543 STDOUT terraform1.10.5:   + resource "aws_autoscaling_group" "idc" {
09:25:59.543 STDOUT terraform1.10.5:       + arn                              = (known after apply)
09:25:59.543 STDOUT terraform1.10.5:       + availability_zones               = (known after apply)
09:25:59.543 STDOUT terraform1.10.5:       + default_cooldown                 = (known after apply)
09:25:59.543 STDOUT terraform1.10.5:       + desired_capacity                 = (known after apply)
09:25:59.543 STDOUT terraform1.10.5:       + force_delete                     = false
09:25:59.543 STDOUT terraform1.10.5:       + force_delete_warm_pool           = false
09:25:59.543 STDOUT terraform1.10.5:       + health_check_grace_period        = 300
09:25:59.543 STDOUT terraform1.10.5:       + health_check_type                = "EC2"
09:25:59.543 STDOUT terraform1.10.5:       + id                               = (known after apply)
09:25:59.543 STDOUT terraform1.10.5:       + ignore_failed_scaling_activities = false
09:25:59.543 STDOUT terraform1.10.5:       + load_balancers                   = (known after apply)
09:25:59.543 STDOUT terraform1.10.5:       + max_size                         = 2
09:25:59.543 STDOUT terraform1.10.5:       + metrics_granularity              = "1Minute"
09:25:59.544 STDOUT terraform1.10.5:       + min_size                         = 1
09:25:59.544 STDOUT terraform1.10.5:       + name                             = "t1-skeleton-eu-central-1-mycluster5-on-demand"
09:25:59.544 STDOUT terraform1.10.5:       + name_prefix                      = (known after apply)
09:25:59.544 STDOUT terraform1.10.5:       + predicted_capacity               = (known after apply)
09:25:59.544 STDOUT terraform1.10.5:       + protect_from_scale_in            = true
09:25:59.544 STDOUT terraform1.10.5:       + service_linked_role_arn          = (known after apply)
09:25:59.544 STDOUT terraform1.10.5:       + target_group_arns                = (known after apply)
09:25:59.544 STDOUT terraform1.10.5:       + termination_policies             = [
09:25:59.544 STDOUT terraform1.10.5:           + "ClosestToNextInstanceHour",
09:25:59.544 STDOUT terraform1.10.5:         ]
09:25:59.544 STDOUT terraform1.10.5:       + vpc_zone_identifier              = [
09:25:59.544 STDOUT terraform1.10.5:           + "subnet-123456",
09:25:59.544 STDOUT terraform1.10.5:         ]
09:25:59.544 STDOUT terraform1.10.5:       + wait_for_capacity_timeout        = "10m"
09:25:59.544 STDOUT terraform1.10.5:       + warm_pool_size                   = (known after apply)
09:25:59.544 STDOUT terraform1.10.5:       + availability_zone_distribution (known after apply)
09:25:59.544 STDOUT terraform1.10.5:       + launch_template {
09:25:59.544 STDOUT terraform1.10.5:           + id      = (known after apply)
09:25:59.544 STDOUT terraform1.10.5:           + name    = (known after apply)
09:25:59.544 STDOUT terraform1.10.5:           + version = "$Latest"
09:25:59.544 STDOUT terraform1.10.5:         }
09:25:59.544 STDOUT terraform1.10.5:       + mixed_instances_policy (known after apply)
09:25:59.544 STDOUT terraform1.10.5:       + tag {
09:25:59.544 STDOUT terraform1.10.5:           + key                 = "AmazonECSManaged"
09:25:59.544 STDOUT terraform1.10.5:           + propagate_at_launch = true
09:25:59.544 STDOUT terraform1.10.5:           + value               = "true"
09:25:59.545 STDOUT terraform1.10.5:         }
09:25:59.545 STDOUT terraform1.10.5:       + tag {
09:25:59.545 STDOUT terraform1.10.5:           + key                 = "Environment"
09:25:59.545 STDOUT terraform1.10.5:           + propagate_at_launch = true
09:25:59.545 STDOUT terraform1.10.5:           + value               = "t1"
09:25:59.545 STDOUT terraform1.10.5:         }
09:25:59.545 STDOUT terraform1.10.5:       + tag {
09:25:59.545 STDOUT terraform1.10.5:           + key                 = "Name"
09:25:59.545 STDOUT terraform1.10.5:           + propagate_at_launch = true
09:25:59.545 STDOUT terraform1.10.5:           + value               = "t1-skeleton-eu-central-1-mycluster5-on-demand"
09:25:59.545 STDOUT terraform1.10.5:         }
09:25:59.545 STDOUT terraform1.10.5:       + tag {
09:25:59.545 STDOUT terraform1.10.5:           + key                 = "Namespace"
09:25:59.545 STDOUT terraform1.10.5:           + propagate_at_launch = true
09:25:59.545 STDOUT terraform1.10.5:           + value               = "skeleton"
09:25:59.545 STDOUT terraform1.10.5:         }
09:25:59.545 STDOUT terraform1.10.5:       + tag {
09:25:59.545 STDOUT terraform1.10.5:           + key                 = "Region"
09:25:59.545 STDOUT terraform1.10.5:           + propagate_at_launch = true
09:25:59.545 STDOUT terraform1.10.5:           + value               = "eu-central-1"
09:25:59.545 STDOUT terraform1.10.5:         }
09:25:59.545 STDOUT terraform1.10.5:       + timeouts {}
09:25:59.545 STDOUT terraform1.10.5:       + traffic_source (known after apply)
09:25:59.545 STDOUT terraform1.10.5:     }
09:25:59.545 STDOUT terraform1.10.5:   # module.autoscaling["on-demand"].aws_iam_instance_profile.this[0] will be created
09:25:59.545 STDOUT terraform1.10.5:   + resource "aws_iam_instance_profile" "this" {
09:25:59.545 STDOUT terraform1.10.5:       + arn         = (known after apply)
09:25:59.545 STDOUT terraform1.10.5:       + create_date = (known after apply)
09:25:59.545 STDOUT terraform1.10.5:       + id          = (known after apply)
09:25:59.545 STDOUT terraform1.10.5:       + name        = "t1-skeleton-eu-central-1-mycluster5-on-demand-role"
09:25:59.545 STDOUT terraform1.10.5:       + name_prefix = (known after apply)
09:25:59.545 STDOUT terraform1.10.5:       + path        = "/"
09:25:59.545 STDOUT terraform1.10.5:       + role        = "t1-skeleton-eu-central-1-mycluster5-on-demand-role"
09:25:59.545 STDOUT terraform1.10.5:       + tags        = {
09:25:59.545 STDOUT terraform1.10.5:           + "Environment" = "t1"
09:25:59.545 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
09:25:59.546 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
09:25:59.546 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
09:25:59.546 STDOUT terraform1.10.5:         }
09:25:59.546 STDOUT terraform1.10.5:       + tags_all    = {
09:25:59.546 STDOUT terraform1.10.5:           + "Environment" = "t1"
09:25:59.546 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
09:25:59.546 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
09:25:59.546 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
09:25:59.546 STDOUT terraform1.10.5:         }
09:25:59.546 STDOUT terraform1.10.5:       + unique_id   = (known after apply)
09:25:59.546 STDOUT terraform1.10.5:     }
09:25:59.546 STDOUT terraform1.10.5:   # module.autoscaling["on-demand"].aws_iam_role.this[0] will be created
09:25:59.546 STDOUT terraform1.10.5:   + resource "aws_iam_role" "this" {
09:25:59.546 STDOUT terraform1.10.5:       + arn                   = (known after apply)
09:25:59.546 STDOUT terraform1.10.5:       + assume_role_policy    = jsonencode(
09:25:59.546 STDOUT terraform1.10.5:             {
09:25:59.546 STDOUT terraform1.10.5:               + Statement = [
09:25:59.546 STDOUT terraform1.10.5:                   + {
09:25:59.546 STDOUT terraform1.10.5:                       + Action    = "sts:AssumeRole"
09:25:59.546 STDOUT terraform1.10.5:                       + Effect    = "Allow"
09:25:59.546 STDOUT terraform1.10.5:                       + Principal = {
09:25:59.546 STDOUT terraform1.10.5:                           + Service = "ec2.amazonaws.com"
09:25:59.546 STDOUT terraform1.10.5:                         }
09:25:59.546 STDOUT terraform1.10.5:                       + Sid       = "EC2AssumeRole"
09:25:59.546 STDOUT terraform1.10.5:                     },
09:25:59.546 STDOUT terraform1.10.5:                 ]
09:25:59.546 STDOUT terraform1.10.5:               + Version   = "2012-10-17"
09:25:59.606 STDOUT terraform1.10.5:             }
09:25:59.606 STDOUT terraform1.10.5:         )
09:25:59.606 STDOUT terraform1.10.5:       + create_date           = (known after apply)
09:25:59.606 STDOUT terraform1.10.5:       + description           = "ECS role for t1-skeleton-eu-central-1-mycluster5"
09:25:59.607 STDOUT terraform1.10.5:       + force_detach_policies = true
09:25:59.607 STDOUT terraform1.10.5:       + id                    = (known after apply)
09:25:59.607 STDOUT terraform1.10.5:       + managed_policy_arns   = (known after apply)
09:25:59.608 STDOUT terraform1.10.5:       + max_session_duration  = 3600
09:25:59.608 STDOUT terraform1.10.5:       + name                  = "t1-skeleton-eu-central-1-mycluster5-on-demand-role"
09:25:59.608 STDOUT terraform1.10.5:       + name_prefix           = (known after apply)
09:25:59.608 STDOUT terraform1.10.5:       + path                  = "/"
09:25:59.608 STDOUT terraform1.10.5:       + tags                  = {
09:25:59.608 STDOUT terraform1.10.5:           + "Environment" = "t1"
09:25:59.608 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
09:25:59.608 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
09:25:59.608 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
09:25:59.608 STDOUT terraform1.10.5:         }
09:25:59.608 STDOUT terraform1.10.5:       + tags_all              = {
09:25:59.608 STDOUT terraform1.10.5:           + "Environment" = "t1"
09:25:59.608 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
09:25:59.608 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
09:25:59.608 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
09:25:59.608 STDOUT terraform1.10.5:         }
09:25:59.608 STDOUT terraform1.10.5:       + unique_id             = (known after apply)
09:25:59.608 STDOUT terraform1.10.5:       + inline_policy (known after apply)
09:25:59.608 STDOUT terraform1.10.5:     }
09:25:59.608 STDOUT terraform1.10.5:   # module.autoscaling["on-demand"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerServiceforEC2Role"] will be created
09:25:59.608 STDOUT terraform1.10.5:   + resource "aws_iam_role_policy_attachment" "this" {
09:25:59.609 STDOUT terraform1.10.5:       + id         = (known after apply)
09:25:59.609 STDOUT terraform1.10.5:       + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
09:25:59.609 STDOUT terraform1.10.5:       + role       = "t1-skeleton-eu-central-1-mycluster5-on-demand-role"
09:25:59.609 STDOUT terraform1.10.5:     }
09:25:59.609 STDOUT terraform1.10.5:   # module.autoscaling["on-demand"].aws_iam_role_policy_attachment.this["AmazonSSMManagedInstanceCore"] will be created
09:25:59.609 STDOUT terraform1.10.5:   + resource "aws_iam_role_policy_attachment" "this" {
09:25:59.609 STDOUT terraform1.10.5:       + id         = (known after apply)
09:25:59.609 STDOUT terraform1.10.5:       + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
09:25:59.609 STDOUT terraform1.10.5:       + role       = "t1-skeleton-eu-central-1-mycluster5-on-demand-role"
09:25:59.609 STDOUT terraform1.10.5:     }
09:25:59.609 STDOUT terraform1.10.5:   # module.autoscaling["on-demand"].aws_launch_template.this[0] will be created
09:25:59.609 STDOUT terraform1.10.5:   + resource "aws_launch_template" "this" {
09:25:59.609 STDOUT terraform1.10.5:       + arn                    = (known after apply)
09:25:59.609 STDOUT terraform1.10.5:       + default_version        = (known after apply)
09:25:59.609 STDOUT terraform1.10.5:       + description            = "Launch template t1-skeleton-eu-central-1-mycluster5"
09:25:59.609 STDOUT terraform1.10.5:       + id                     = (known after apply)
09:25:59.609 STDOUT terraform1.10.5:       + image_id               = (sensitive value)
09:25:59.609 STDOUT terraform1.10.5:       + instance_type          = "t3.medium"
09:25:59.609 STDOUT terraform1.10.5:       + latest_version         = (known after apply)
09:25:59.609 STDOUT terraform1.10.5:       + name                   = "t1-skeleton-eu-central-1-mycluster5-on-demand-lt"
09:25:59.609 STDOUT terraform1.10.5:       + name_prefix            = (known after apply)
09:25:59.610 STDOUT terraform1.10.5:       + tags                   = {
09:25:59.610 STDOUT terraform1.10.5:           + "Environment" = "t1"
09:25:59.610 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
09:25:59.610 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
09:25:59.610 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
09:25:59.610 STDOUT terraform1.10.5:         }
09:25:59.610 STDOUT terraform1.10.5:       + tags_all               = {
09:25:59.610 STDOUT terraform1.10.5:           + "Environment" = "t1"
09:25:59.610 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
09:25:59.610 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
09:25:59.610 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
09:25:59.610 STDOUT terraform1.10.5:         }
09:25:59.610 STDOUT terraform1.10.5:       + update_default_version = true
09:25:59.610 STDOUT terraform1.10.5:       + user_data              = "IyEvYmluL2Jhc2gKCmNhdCA8PCdFT0YnID4+IC9ldGMvZWNzL2Vjcy5jb25maWcKRUNTX0NMVVNURVI9dDEtc2tlbGV0b24tZXUtY2VudHJhbC0xLW15Y2x1c3RlcjUKRUNTX0xPR0xFVkVMPWRlYnVnCkVDU19DT05UQUlORVJfSU5TVEFOQ0VfVEFHUz17IkVudmlyb25tZW50IjoidDEiLCJOYW1lIjoidDEtc2tlbGV0b24tZXUtY2VudHJhbC0xLW15Y2x1c3RlcjUiLCJOYW1lc3BhY2UiOiJza2VsZXRvbiIsIlJlZ2lvbiI6ImV1LWNlbnRyYWwtMSJ9CkVDU19FTkFCTEVfVEFTS19JQU1fUk9MRT10cnVlCkVPRgoK"
09:25:59.610 STDOUT terraform1.10.5:       + vpc_security_group_ids = (known after apply)
09:25:59.610 STDOUT terraform1.10.5:       + iam_instance_profile (known after apply)
09:25:59.610 STDOUT terraform1.10.5:       + metadata_options (known after apply)
09:25:59.611 STDOUT terraform1.10.5:       + monitoring {
09:25:59.611 STDOUT terraform1.10.5:           + enabled = true
09:25:59.611 STDOUT terraform1.10.5:         }
09:25:59.611 STDOUT terraform1.10.5:     }
09:25:59.611 STDOUT terraform1.10.5:   # module.autoscaling_sg.aws_security_group.this[0] will be created
09:25:59.611 STDOUT terraform1.10.5:   + resource "aws_security_group" "this" {
09:25:59.611 STDOUT terraform1.10.5:       + arn                    = (known after apply)
09:25:59.611 STDOUT terraform1.10.5:       + description            = "Autoscaling group security group for t1-skeleton-eu-central-1-mycluster5"
09:25:59.611 STDOUT terraform1.10.5:       + egress                 = (known after apply)
09:25:59.611 STDOUT terraform1.10.5:       + id                     = (known after apply)
09:25:59.611 STDOUT terraform1.10.5:       + ingress                = (known after apply)
09:25:59.611 STDOUT terraform1.10.5:       + name                   = "t1-skeleton-eu-central-1-mycluster5-asg-sg"
09:25:59.611 STDOUT terraform1.10.5:       + name_prefix            = (known after apply)
09:25:59.611 STDOUT terraform1.10.5:       + owner_id               = (known after apply)
09:25:59.611 STDOUT terraform1.10.5:       + revoke_rules_on_delete = false
09:25:59.611 STDOUT terraform1.10.5:       + tags                   = {
09:25:59.611 STDOUT terraform1.10.5:           + "Environment" = "t1"
09:25:59.611 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
09:25:59.611 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
09:25:59.611 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
09:25:59.611 STDOUT terraform1.10.5:         }
09:25:59.611 STDOUT terraform1.10.5:       + tags_all               = {
09:25:59.611 STDOUT terraform1.10.5:           + "Environment" = "t1"
09:25:59.611 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
09:25:59.611 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
09:25:59.612 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
09:25:59.612 STDOUT terraform1.10.5:         }
09:25:59.612 STDOUT terraform1.10.5:       + vpc_id                 = "vpc-12345678"
09:25:59.612 STDOUT terraform1.10.5:       + timeouts {
09:25:59.612 STDOUT terraform1.10.5:           + create = "10m"
09:25:59.612 STDOUT terraform1.10.5:           + delete = "15m"
09:25:59.612 STDOUT terraform1.10.5:         }
09:25:59.612 STDOUT terraform1.10.5:     }
09:25:59.612 STDOUT terraform1.10.5:   # module.autoscaling_sg.aws_security_group_rule.egress_rules[0] will be created
09:25:59.612 STDOUT terraform1.10.5:   + resource "aws_security_group_rule" "egress_rules" {
09:25:59.612 STDOUT terraform1.10.5:       + cidr_blocks              = [
09:25:59.612 STDOUT terraform1.10.5:           + "0.0.0.0/0",
09:25:59.612 STDOUT terraform1.10.5:         ]
09:25:59.612 STDOUT terraform1.10.5:       + description              = "All protocols"
09:25:59.612 STDOUT terraform1.10.5:       + from_port                = -1
09:25:59.612 STDOUT terraform1.10.5:       + id                       = (known after apply)
09:25:59.612 STDOUT terraform1.10.5:       + ipv6_cidr_blocks         = [
09:25:59.613 STDOUT terraform1.10.5:           + "::/0",
09:25:59.613 STDOUT terraform1.10.5:         ]
09:25:59.613 STDOUT terraform1.10.5:       + prefix_list_ids          = []
09:25:59.613 STDOUT terraform1.10.5:       + protocol                 = "-1"
09:25:59.613 STDOUT terraform1.10.5:       + security_group_id        = (known after apply)
09:25:59.613 STDOUT terraform1.10.5:       + security_group_rule_id   = (known after apply)
09:25:59.613 STDOUT terraform1.10.5:       + self                     = false
09:25:59.613 STDOUT terraform1.10.5:       + source_security_group_id = (known after apply)
09:25:59.613 STDOUT terraform1.10.5:       + to_port                  = -1
09:25:59.613 STDOUT terraform1.10.5:       + type                     = "egress"
09:25:59.613 STDOUT terraform1.10.5:     }
09:25:59.613 STDOUT terraform1.10.5:   # module.ecs_cluster.aws_cloudwatch_log_group.this[0] will be created
09:25:59.613 STDOUT terraform1.10.5:   + resource "aws_cloudwatch_log_group" "this" {
09:25:59.613 STDOUT terraform1.10.5:       + arn               = (known after apply)
09:25:59.613 STDOUT terraform1.10.5:       + id                = (known after apply)
09:25:59.613 STDOUT terraform1.10.5:       + log_group_class   = (known after apply)
09:25:59.613 STDOUT terraform1.10.5:       + name              = "/aws/ecs/t1-skeleton-eu-central-1-mycluster5"
09:25:59.613 STDOUT terraform1.10.5:       + name_prefix       = (known after apply)
09:25:59.613 STDOUT terraform1.10.5:       + retention_in_days = 90
09:25:59.614 STDOUT terraform1.10.5:       + skip_destroy      = false
09:25:59.614 STDOUT terraform1.10.5:       + tags              = {
09:25:59.614 STDOUT terraform1.10.5:           + "Environment" = "t1"
09:25:59.614 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
09:25:59.614 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
09:25:59.614 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
09:25:59.614 STDOUT terraform1.10.5:         }
09:25:59.614 STDOUT terraform1.10.5:       + tags_all          = {
09:25:59.614 STDOUT terraform1.10.5:           + "Environment" = "t1"
09:25:59.614 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
09:25:59.614 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
09:25:59.614 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
09:25:59.614 STDOUT terraform1.10.5:         }
09:25:59.614 STDOUT terraform1.10.5:     }
09:25:59.614 STDOUT terraform1.10.5:   # module.ecs_cluster.aws_ecs_capacity_provider.this["on-demand"] will be created
09:25:59.614 STDOUT terraform1.10.5:   + resource "aws_ecs_capacity_provider" "this" {
09:25:59.614 STDOUT terraform1.10.5:       + arn      = (known after apply)
09:25:59.614 STDOUT terraform1.10.5:       + id       = (known after apply)
09:25:59.614 STDOUT terraform1.10.5:       + name     = "t1-skeleton-eu-central-1-mycluster5-on-demand"
09:25:59.614 STDOUT terraform1.10.5:       + tags     = {
09:25:59.614 STDOUT terraform1.10.5:           + "Environment" = "t1"
09:25:59.614 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
09:25:59.615 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
09:25:59.615 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
09:25:59.615 STDOUT terraform1.10.5:         }
09:25:59.615 STDOUT terraform1.10.5:       + tags_all = {
09:25:59.615 STDOUT terraform1.10.5:           + "Environment" = "t1"
09:25:59.615 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
09:25:59.615 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
09:25:59.615 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
09:25:59.615 STDOUT terraform1.10.5:         }
09:25:59.615 STDOUT terraform1.10.5:       + auto_scaling_group_provider {
09:25:59.615 STDOUT terraform1.10.5:           + auto_scaling_group_arn         = (known after apply)
09:25:59.615 STDOUT terraform1.10.5:           + managed_draining               = (known after apply)
09:25:59.615 STDOUT terraform1.10.5:           + managed_termination_protection = "ENABLED"
09:25:59.615 STDOUT terraform1.10.5:           + managed_scaling {
09:25:59.615 STDOUT terraform1.10.5:               + instance_warmup_period    = (known after apply)
09:25:59.615 STDOUT terraform1.10.5:               + maximum_scaling_step_size = 5
09:25:59.615 STDOUT terraform1.10.5:               + minimum_scaling_step_size = 1
09:25:59.615 STDOUT terraform1.10.5:               + status                    = "ENABLED"
09:25:59.615 STDOUT terraform1.10.5:               + target_capacity           = 60
09:25:59.616 STDOUT terraform1.10.5:             }
09:25:59.616 STDOUT terraform1.10.5:         }
09:25:59.616 STDOUT terraform1.10.5:     }
09:25:59.616 STDOUT terraform1.10.5:   # module.ecs_cluster.aws_ecs_cluster.this[0] will be created
09:25:59.616 STDOUT terraform1.10.5:   + resource "aws_ecs_cluster" "this" {
09:25:59.616 STDOUT terraform1.10.5:       + arn      = (known after apply)
09:25:59.616 STDOUT terraform1.10.5:       + id       = (known after apply)
09:25:59.616 STDOUT terraform1.10.5:       + name     = "t1-skeleton-eu-central-1-mycluster5"
09:25:59.616 STDOUT terraform1.10.5:       + tags     = {
09:25:59.616 STDOUT terraform1.10.5:           + "Environment" = "t1"
09:25:59.616 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
09:25:59.616 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
09:25:59.616 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
09:25:59.616 STDOUT terraform1.10.5:         }
09:25:59.616 STDOUT terraform1.10.5:       + tags_all = {
09:25:59.616 STDOUT terraform1.10.5:           + "Environment" = "t1"
09:25:59.616 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
09:25:59.616 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
09:25:59.620 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
09:25:59.620 STDOUT terraform1.10.5:         }
09:25:59.620 STDOUT terraform1.10.5:       + configuration {
09:25:59.620 STDOUT terraform1.10.5:           + execute_command_configuration {
09:25:59.620 STDOUT terraform1.10.5:               + logging = "DEFAULT"
09:25:59.620 STDOUT terraform1.10.5:             }
09:25:59.620 STDOUT terraform1.10.5:         }
09:25:59.620 STDOUT terraform1.10.5:       + setting {
09:25:59.620 STDOUT terraform1.10.5:           + name  = "containerInsights"
09:25:59.620 STDOUT terraform1.10.5:           + value = "enabled"
09:25:59.620 STDOUT terraform1.10.5:         }
09:25:59.620 STDOUT terraform1.10.5:     }
09:25:59.620 STDOUT terraform1.10.5:   # module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0] will be created
09:25:59.620 STDOUT terraform1.10.5:   + resource "aws_ecs_cluster_capacity_providers" "this" {
09:25:59.620 STDOUT terraform1.10.5:       + capacity_providers = [
09:25:59.620 STDOUT terraform1.10.5:           + "t1-skeleton-eu-central-1-mycluster5-on-demand",
09:25:59.621 STDOUT terraform1.10.5:         ]
09:25:59.621 STDOUT terraform1.10.5:       + cluster_name       = "t1-skeleton-eu-central-1-mycluster5"
09:25:59.621 STDOUT terraform1.10.5:       + id                 = (known after apply)
09:25:59.621 STDOUT terraform1.10.5:       + default_capacity_provider_strategy {
09:25:59.621 STDOUT terraform1.10.5:           + base              = 20
09:25:59.621 STDOUT terraform1.10.5:           + capacity_provider = "t1-skeleton-eu-central-1-mycluster5-on-demand"
09:25:59.621 STDOUT terraform1.10.5:           + weight            = 60
09:25:59.621 STDOUT terraform1.10.5:         }
09:25:59.621 STDOUT terraform1.10.5:     }
09:25:59.621 STDOUT terraform1.10.5: Plan: 12 to add, 0 to change, 0 to destroy.
09:25:59.621 STDOUT terraform1.10.5: 
09:25:59.621 STDOUT terraform1.10.5: Changes to Outputs:
09:25:59.621 STDOUT terraform1.10.5:   + cluster_arn                            = (known after apply)
09:25:59.621 STDOUT terraform1.10.5:   + cluster_autoscaling_capacity_providers = {
09:25:59.621 STDOUT terraform1.10.5:       + on-demand = {
09:25:59.621 STDOUT terraform1.10.5:           + arn                         = (known after apply)
09:25:59.621 STDOUT terraform1.10.5:           + auto_scaling_group_provider = [
09:25:59.621 STDOUT terraform1.10.5:               + {
09:25:59.621 STDOUT terraform1.10.5:                   + auto_scaling_group_arn         = (known after apply)
09:25:59.621 STDOUT terraform1.10.5:                   + managed_draining               = (known after apply)
09:25:59.622 STDOUT terraform1.10.5:                   + managed_scaling                = [
09:25:59.622 STDOUT terraform1.10.5:                       + {
09:25:59.622 STDOUT terraform1.10.5:                           + instance_warmup_period    = (known after apply)
09:25:59.622 STDOUT terraform1.10.5:                           + maximum_scaling_step_size = 5
09:25:59.622 STDOUT terraform1.10.5:                           + minimum_scaling_step_size = 1
09:25:59.622 STDOUT terraform1.10.5:                           + status                    = "ENABLED"
09:25:59.622 STDOUT terraform1.10.5:                           + target_capacity           = 60
09:25:59.622 STDOUT terraform1.10.5:                         },
09:25:59.622 STDOUT terraform1.10.5:                     ]
09:25:59.622 STDOUT terraform1.10.5:                   + managed_termination_protection = "ENABLED"
09:25:59.622 STDOUT terraform1.10.5:                 },
09:25:59.622 STDOUT terraform1.10.5:             ]
09:25:59.622 STDOUT terraform1.10.5:           + id                          = (known after apply)
09:25:59.622 STDOUT terraform1.10.5:           + name                        = "t1-skeleton-eu-central-1-mycluster5-on-demand"
09:25:59.622 STDOUT terraform1.10.5:           + tags                        = {
09:25:59.622 STDOUT terraform1.10.5:               + Environment = "t1"
09:25:59.622 STDOUT terraform1.10.5:               + Name        = "t1-skeleton-eu-central-1-mycluster5"
09:25:59.622 STDOUT terraform1.10.5:               + Namespace   = "skeleton"
09:25:59.623 STDOUT terraform1.10.5:               + Region      = "eu-central-1"
09:25:59.623 STDOUT terraform1.10.5:             }
09:25:59.623 STDOUT terraform1.10.5:           + tags_all                    = {
09:25:59.623 STDOUT terraform1.10.5:               + Environment = "t1"
09:25:59.623 STDOUT terraform1.10.5:               + Name        = "t1-skeleton-eu-central-1-mycluster5"
09:25:59.623 STDOUT terraform1.10.5:               + Namespace   = "skeleton"
09:25:59.623 STDOUT terraform1.10.5:               + Region      = "eu-central-1"
09:25:59.623 STDOUT terraform1.10.5:             }
09:25:59.623 STDOUT terraform1.10.5:         }
09:25:59.623 STDOUT terraform1.10.5:     }
09:25:59.623 STDOUT terraform1.10.5:   + cluster_capacity_providers             = (known after apply)
09:25:59.623 STDOUT terraform1.10.5:   + cluster_id                             = (known after apply)
09:25:59.623 STDOUT terraform1.10.5:   + cluster_name                           = "t1-skeleton-eu-central-1-mycluster5"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d devops-dev/t1/eu-central-1/skeleton/ecs_clusters/mycluster5 -w devops-dev_t1_eu-central-1_skeleton_ecs_clusters_mycluster5
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://global-common-eu-central-1-atlantis.skeleton-dev.testenv.io/lock?id=cryptocat-org%252Fdevops-digger%252Fdevops-dev%252Ft1%252Feu-central-1%252Fskeleton%252Fecs_clusters%252Fmycluster5%252Fdevops-dev_t1_eu-central-1_skeleton_ecs_clusters_mycluster5)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d devops-dev/t1/eu-central-1/skeleton/ecs_clusters/mycluster5 -w devops-dev_t1_eu-central-1_skeleton_ecs_clusters_mycluster5
  ```
Plan: 12 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```